{"config": [{"config": {"output_shape": [300, 1280, 3], "trainable": true, "name": "lambda_6", "output_shape_type": "raw", "arguments": {}, "dtype": "float32", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bS)\u0002N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001e<ipython-input-4-f33f89634d27>\u00da\b<lambda>\t\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 300, 1280, 3]}, "class_name": "Lambda"}, {"config": {"kernel_regularizer": null, "trainable": true, "name": "conv2d_21", "filters": 16, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 300, 1280, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_21", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "name": "conv2d_22", "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_22", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "name": "conv2d_23", "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "dropout_23", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"padding": "valid", "strides": [8, 8], "trainable": true, "name": "max_pooling2d_6", "data_format": "channels_last", "pool_size": [8, 8]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_24", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "name": "conv2d_24", "filters": 1, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "padding": "valid", "kernel_size": [8, 8], "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}], "backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Sequential"}